Examinator/src/Documents/НовостьСУО/НовостьСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НовостьСУО</name>
  <registerRecords>InformationRegister.НовостиСУО</registerRecords>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Выделить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрепить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/НовостьСУО/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТекстНовости = ТекущийОбъект.ФорматированныйДокумент.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ФорматированныйДокумент = Новый ХранилищеЗначения(ТекстНовости, Новый СжатиеДанных(9));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаПубликации = ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.БыстроеСоздание Тогда
		
		Элементы.Параметры.Видимость = Ложь;
		
		Если Элементы.Найти("ФормаПровестиИЗакрыть") <> Неопределено Тогда
			Элементы.ФормаПровестиИЗакрыть.Заголовок = "Записать";	
		КонецЕсли;
		
		Если Элементы.Найти("ФормаПровести") <> Неопределено Тогда
			Элементы.ФормаПровести.Видимость = Ложь;
		КонецЕсли;
		
		Если Элементы.Найти("ФормаЗаписать") <> Неопределено Тогда
			Элементы.ФормаЗаписать.Видимость = Ложь;
		КонецЕсли;
		
		Если Элементы.Найти("ФормаСкопировать") <> Неопределено Тогда
			Элементы.ФормаСкопировать.Видимость = Ложь;
		КонецЕсли;
		
		Если Элементы.Найти("ФормаСоздатьНаОсновании") <> Неопределено Тогда
			Элементы.ФормаСоздатьНаОсновании.Видимость = Ложь;
		КонецЕсли;
		
		Если Элементы.Найти("ФормаПеречитать") <> Неопределено Тогда
			Элементы.ФормаПеречитать.Видимость = Ложь;
		КонецЕсли;
			
		Если Элементы.Найти("ФормаУстановитьПометкуУдаления") <> Неопределено Тогда
			Элементы.ФормаУстановитьПометкуУдаления.Видимость = Ложь;
		КонецЕсли;
		
		Если Элементы.Найти("ФормаОтменаПроведения") <> Неопределено Тогда
			Элементы.ФормаОтменаПроведения.Видимость = Ложь;
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.ИдентификаторОбъектаКопирования) Тогда
		
		ЭлементКопирования = Документы.НовостьСУО.ПолучитьСсылку(Объект.ИдентификаторОбъектаКопирования);

		ТекстНовости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементКопирования, "ФорматированныйДокумент").Получить();
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолучатели

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Получатели

&НаКлиенте
Процедура ПолучателиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;
	
	Объект.Получатели.Очистить();
	 
	Для каждого ВыбранныйПользователь Из ВыбранноеЗначение Цикл
	
		НоваяСтрока = Объект.Получатели.Добавить();
		НоваяСтрока.Пользователь = ВыбранныйПользователь; 		
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Подбор(Команда)
	
	АдресСпискаВХранилище = ПоместитьСписокПользователейВХранилище();
	
	ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
	ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Получатели);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПоместитьСписокПользователейВХранилище()
	
	ВременнаяТаблицаПользователей = Новый ТаблицаЗначений();
	ВременнаяТаблицаПользователей.Колонки.Добавить("Пользователь");
	ВременнаяТаблицаПользователей.Колонки.Добавить("Наименование");
	
	Для каждого Строка Из Объект.Получатели Цикл
	
		НоваяСтрока = ВременнаяТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = Строка.Пользователь;
		НоваяСтрока.Наименование = Строка.Пользователь.Наименование;
	
	КонецЦикла;
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ВременнаяТаблицаПользователей, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;	
	
	
КонецФункции

#КонецОбласти
